{
    "emilyCarrUniversity": {
        "name": "Emily Carr University of Art + Design",
        "acronym": "Emily Carr",
        "canadianRanking": "",
        "worldRanking": "",
        "address": "520 E 1st Ave, Vancouver, BC V5T 0H2, Canada",
        "province": "BC",
        "countryCode": "CA",
        "geotag": [
            "west",
            "Vancouver"
        ],
        "googleMapURL": "https://goo.gl/maps/NyXWWyi1b36fh7fp8",
        "admissionEmail": "admissions@ecuad.ca",
        "phoneNumber": "+1 604-844-3800",
        "websiteURL": "https://www.ecuad.ca//",
        "langRequirement": "\"{'url': 'https://www.educationplannerbc.ca/institution/view/EC', 'type': {'langTestType': [{'testName': 'TOEFL internet-based', 'testMinScore': '84 overall, with at least 20 in Speaking, 20 Reading, 18 Writing and 20 Listening'}, {'testName': 'IELTS', 'testMinScore': '6.5 overall with no band less than 6.0'}, {'testName': 'CAEL', 'testMinScore': 70}, {'testName': 'PTE', 'testMinScore': 56}, {'testName': 'CPE', 'testMinScore': '176 overall, with no sub section below 169'}, {'testName': 'MELAB (Michigan English Language Assessment Battery)', 'testMinScore': 81}, {'testName': 'CELPIP (Canadian English Proficiency Index Program)', 'testMinScore': 'Academic Level 4L'}, {'testName': 'Duolingo English Test', 'testMinScore': 110}]}}\"",
        "courses": {
            "minor": [
                {
                    "courseName": "Sculpture + Expanded Practices",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "For artists enthralled by 3D forms.\nOur unique Sculpture + Expanded Practices program encompasses traditional methods for producing sculpture, including wood, metal, and mould-making, as well as textiles and soft sculpture, such as weaving, sewing, and embroidery.\nNot only that, but it also offers students unparalleled opportunities to learn digital fabrication and work with cutting-edge technologies. Embracing visual art alongside video, sound, interactivity, and performance, our program pushes and challenges the limits of how to approach sculpture as a material practice.\n\nWhat You Will Learn\nInterdisciplinary, experimental, and progressive, Sculpture + Expanded Practices is for visual artists and spatial thinkers who want to work with their hands across sculptures, installations, public art, and more.\nThrough your studio-led courses, taught by leading visual artists, you'll gain essential technical grounding in wood, metal, mould-making and casting, flexible materials, textiles + soft sculpture, and digital fabrication. From site-specific work to constructed objects, you'll experiment with both traditional and non-traditional media, including video, digital media, and kinetics. As your studies progress, you'll have the flexibility to take more advanced courses in the areas of your choice.\nWhile most of your time will be spent working with these machines and materials, you'll also be assigned theoretical readings, and participate in group discussions and presentations. Expect to be immersed in a caring and diverse student body, where you and your peers will support each other as both artists and citizens.\nThrough your courses, led by renowned artists, you'll not only learn and hone your skills, but you'll also be able to situate your own practice in relation to social themes, communities, and contemporary styles. Upon graduation, you'll have produced an impressive body of work that will prepare you for professional roles in the arts.",
                    "url": "https://www.ecuad.ca/sculpture-expanded-practices",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Curatorial Practices",
                    "faculty": "N/A",
                    "programLength": "1 year",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Shape and influence the contemporary art world.\nCurating is not just a job — it's an artistic practice in its own right. Our Curatorial Practices Minor combines research and practice to teach the history, theory, and real-world issues shaping the curatorial field today. Through your coursework, you'll developed an informed perspective on the art world.\n\nWhat You Will Learn\nYou'll study grant-writing, exhibition plans, curatorial proposals, art criticism, and the completion of curatorial projects. You'll also learn about self-curating and curating in relation to your peers. These skills and frameworks are useful for any practicing artist or designer, whether showcasing their own work or exhibiting others.\nYou may also have the opportunity to complete internships and participate in external collaborations, preparing you to integrate curatorial strategies into your career path and material practices in the future.\nThe Curatorial Practices Minor is open to students in all areas. Whatever your major, your studies in curation will complement and bolster your creative practice.",
                    "url": "https://www.ecuad.ca/curatorial",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '11,553.63', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'N/A'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Ceramics",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Bringing design to life, experimenting with form, and investigating modes of production.\nCeramics exist at the intersection of art and design, form and function. The result is a thrilling area of study. A truly interdisciplinary field, ceramics integrates sculpture, painting, drawing, design, architecture, photography, and other materials.\n\nWhat You Will Learn\nThe field of ceramics is rich in history— and thanks to modern technologies and equipment, it's also filled with exciting new possibilities. Here, you'll have the opportunity to take hands-on, immersive studio courses, and develop skills in many traditional methods, including wheel throwing, hand building, and mold making, to name a few. You'll also learn to use modern digital applications and tools, including 3D printers and computer-controlled cutting machines.\nAs you hone your craft, you'll also have the freedom to experiment with blending various art practices across sculpture, design, painting, printmaking, and photography. You’ll be encouraged to find your voice and develop your aesthetic through hands-on experimentation.\nStudents who are interested in functional applications may also choose to take a number of industrial design courses, focusing on the material production of everyday objects and their cultural significance.\nAlongside your studio work, you'll take conceptual courses that provide a strong theoretical foundation through which to understand ceramics' many applications, methods of labour and production, and relationship to cultural trends. Throughout your studies, you'll learn frameworks, techniques, and best practices from established artists paving the way in the field of ceramics.\nBoth your conceptual and hands-on learning will be strengthened through classes, seminars, self-directed projects, exhibitions, and professional development. Upon graduation, you'll have produced an impressive body of work, and be prepared to launch into your career.",
                    "url": "https://www.ecuad.ca/ceramics",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Painting",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Become the artist you’ve always wanted to be.\nFor visual artists who want to focus on painting, the Painting program will immerse you in a studio culture to nurture your individual practice. You’ll learn from world-renowned practicing artists among a diverse community of creative peers. Together, you'll engage in rigorous dialogue, and learn about traditional and contemporary approaches to painting as a discipline.\nAs you gain a richer understanding of your practice through in-depth studies, you’ll produce a significant body of work that reflects your unique approach as an artist.\n\nWhat You Will Learn\nPainting can take many forms and approaches. In the Painting program, you'll have the opportunity to experiment across a full range of materials and styles. From acrylics to mixed media, analogue to digital, students are given an unparalleled chance to explore their interests and discover their own artistic practice.\nYour education will focus on the studio. Beginning with the foundations, you'll start by focusing on colour, form, and paint handling before moving into advanced classes where you'll develop your individualized painting practice. Along the way, you’ll receive support and personal instruction from accomplished professional artists.\nAlongside painting techniques, you'll learn critical theory and history. While most of your time will be spent in the studio, you'll also engage in collaborative work, theoretical research, and group critiques. Expect to delve into a network of artistic peers — one where you can exchange ideas, share findings, and help each other grow as both artists and citizens.\nThrough your courses and ECU's vibrant, artistic community, you'll not only develop your skills, but you'll also be able to situate your own work in relation to larger social themes, histories, communities, and contemporary styles. By graduation, you’ll have produced a body of work that demonstrates your vision, skill and maturity as a painter.",
                    "url": "https://www.ecuad.ca/painting-program",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Art + Text",
                    "faculty": "N/A",
                    "programLength": "1 year",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Explore the use of text and language in visual art.\nIf you're a creative interested in the intersection of images and words, consider the Art + Text Minor. This minor examines how text functions in image-making, printed texts, artists books, typography, public artworks, recorded speech, and more — and will challenge how you think about the relationship between text and visuals in your own work.\n\nWhat You Will Learn\nWithin the Audain Faculty of Art, the Art + Text Minor looks at the various ways text plays a role in artistic practices. Whether you're interested in the role of text in paintings and sculpture (think: public art, installations), in illustration (such as in children's books), or communication design (product information, wayfinding) this minor will help you think about how text can function in artworks in effective and innovative ways.The minor considers alternative structures of distribution including artist’s books and multiples, libraries, online database projects as well as utilizing typography as an artistic tool. Your coursework will address contemporary practices including text-as-image, the book form, the archive, as well as sound and writing-based practices. With an equal focus on concepts and materials, this minor will develop your ability to incorporate text into your artistic practice.\nThe Art + Text minor is open to students in all areas. No matter your major, your studies in art and text will complement and bolster your creative practice.",
                    "url": "https://www.ecuad.ca/art-text",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '11,553.63', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'N/A'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Print Media",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Where fine art, pop culture and social movements intersect.\nPrint media is all around us, and has defined how we communicate for over a thousand years. As a form of visual art, it includes silkscreen printing, etching, lithography, relief printing, letterpress, bookbinding, digital printing, and risograph printing. And with countless new innovations and technologies, this discipline is only becoming more creative and multidisciplinary.\n\nWhat You Will Learn\nThe Print Media program covers both the history of print media and its traditional practices, as well as the new and exciting possibilities for the art form that exist today. You'll take a mix of hands-on, immersive studio courses and critical studies that will provide a strong theoretical foundation. In your studio courses, you'll have ample opportunity to explore printmaking techniques and develop your own unique artistic practice using our specialized equipment and facilities.\nAs you develop and hone your craft, you'll be able to deepen your conceptual understanding of the global histories of print media and its intersections with fine art, popular culture, mass media, propaganda, marketing, and social movements. You'll have opportunities to conduct research on print history, engage in theoretical discourse, explore various materials, understand and contextualize your own visual choices, and work collaboratively with your peers to produce innovative work.\nBoth your conceptual and hands-on learning will be strengthened through classes, seminars, self-directed projects, exhibitions, and professional development guided by artists who are experts in their fields. Upon graduation, you'll have produced an impressive body of work that will help launch you into further artistic and professional pursuits.",
                    "url": "https://www.ecuad.ca/print-media-program",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Visual Arts",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Unbridled creativity meets unparalleled resources.\nIf you're seeking a one-of-a-kind university experience that is both flexible and rigorous, then the Visual Arts Major is for you.\nRather than commit to one medium, you'll have the chance to develop your artistic practice across five core areas: ceramics, drawing, painting, print media, and sculpture. You'll have the chance to explore many other practices too, including illustration, performance, photography, and curatorial practices.\n\nWhat You Will Learn\nFor independent and fiercely creative students, Visual Arts offers exceptional freedom and choice. Here, you'll create your own academic pathway as you discover your strengths and interests as a visual artist. As you build your creative skills, you'll develop a deep understanding of how various art forms connect and intersect, and the history that informs today's practices.\nYour faculty members, practicing artists who define the Canadian creative landscape, will guide you as you refine your techniques and follow your curiosity. After graduating, you'll have a mature and exceptional body of work to launch your career in visual arts.",
                    "url": "https://www.ecuad.ca/visual-arts",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "New Media + Sound Art",
                    "faculty": "Media Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "When new technologies meet compelling storytelling, the possibilities are endless.\nThrough media and sound, learn creative ways to tell stories and offer unique perspectives. The New Media + Sound Art (NMSA) major is multidisciplinary and flexible, and allows students to create a range of media projects using sound, video, interactive art, digital fabrication, and electronics.\n\nWhat You Will Learn\nThe New Media + Sound Art Major explores the intersections of technology and storytelling. You'll gain both conceptual and practical skills for producing creative, innovative, and experimental research and projects. This may include working with electronic wearables, sonic objects and environments, creative computing, and performing with media.\nYou'll also be encouraged to take electives in other programs, combining interests in media with ceramics, textiles, animation, and sculpture. Throughout your studies, your courses will be taught by award-winning, established artists who are experts in their fields.\nLater in your studies, you'll participate in self-directed projects and research themes including audiovisual experiences, sound ecologies, and making data. In the final year of your studies, you'll work on a larger self-directed piece, research project, or experimental processes.\nYou'll have the freedom to create albums, installations, interactive artwork, textiles, performance pieces, or other products based on your specific interests and talents. Most importantly, you'll graduate with an impressive portfolio of work that will help launch your career or future studies.\nNew Media + Sound Art encourages open-ended inquiry. Throughout your studies, you'll examine how art and technology can contribute toward positive social change, enhance our perceptions, and offer new ways of relating to and protecting the world around us.",
                    "url": "https://www.ecuad.ca/nmsa",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Media Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Social Practice + Community Engagement (SPACE)",
                    "faculty": "N/A",
                    "programLength": "1 year",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Root your creative practice in activism.\nEngage with real-world issues through applied art, design, and media. For students who want to embed their work in the community, the Social Practice and Community Engagement (SPACE) Minor offers you the opportunity to do just that. It complements your studies with a focus on social practice, ecology and sustainability, documentary practices, and community projects.\n\nWhat You Will Learn\nHoused within the Faculty of Culture and Community, the SPACE Minor connects students and citizen groups, industry, non-profit organizations, arts groups, the public school system, and other organizations. Through three core courses, you'll learn ethical frameworks for community engagement that will assist you through internships and external partnerships of all kinds.\nThis minor is designed to be student-led and reflect your individual interests. You’ll choose 9 credits of electives that relate to your own socially-engaged practices. The SPACE Minor also provides faculty mentorship to complement your coursework, through personalized support and collaboration.\nWhatever your creative discipline, the SPACE Minor will complement your studies and enhance your practice. Upon graduation, you'll be prepared to step into community-based research and creation.",
                    "url": "https://www.ecuad.ca/space",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '11,553.63', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'N/A'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "education"
                },
                {
                    "courseName": "Interaction Design",
                    "faculty": "Design",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Engaging technology to connect people and prototype possible futures.\nAre you excited to work at the cutting edge of design, creating meaningful experiences with emerging technologies? The Interaction Design program places you at the centre of new creative practices such as strategic design, information architecture, game design, creative coding, visual + sound design, and behavioural insights.\n\nWhat You Will Learn\nLearn human-centered design methods and make sense of complex problems for more-than-human centered contexts. Choose your own path and learn to design games, services, medical applications and interactive spaces, using hybrid technologies as basic as pen and paper, or as sophisticated as virtual reality.",
                    "url": "https://www.ecuad.ca/interaction-design",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Design'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Illustration",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Create compelling images that challenge and redefine our culture.\nIn the rapidly changing art and design landscape, Illustration is a key form of visual communication. Illustrators need the ability to think critically and innovatively, and be able to engage diverse audiences in a variety of contexts. Our illustration courses explore varied technical approaches and a broad range of pictorial strategies, while cultivating the ability to collaborate and adapt to diverse opportunities, from contemporary art exhibitions to careers in mass-media.\n\nWhat You Will Learn\nHere, you’ll master varied technical approaches while learning their critical and conceptual contexts, preparing you for a future career as a professional illustrator. As you develop your unique style as an artist, you’ll learn to create engaging and distinctive images that complement written content or stand alone.",
                    "url": "https://www.ecuad.ca/illustration-program-page",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Writing",
                    "faculty": "N/A",
                    "programLength": "N/A",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "A site of resistance, experimentation, inquiry, and play.\nWriting is a creative practice in its own right. Like art and design, a writing practice has sketches, masterpieces, final realizations, and everything in between. At ECU, we believe writing does not merely reflect the world, but is also an action in the world.\nThe interdisciplinary Writing track offers students a chance to explore writing in a studio context and to experiment with language in a diverse community of writers.\n\nWhat You Will Learn\nYou can take courses in collaborative writing, script writing, art writing and reviewing, poetry, fiction, and drama, graphic novels and creative nonfiction, editing and publishing, project-based writing and more. You can also engage in creative writing across multiple languages, whatever your fluency, exploring the possibilities of language.\nFocusing on experimentation, we offer you the chance to create a writing practice in an interdisciplinary community and to make connections with your art and design practices. This can include working on specific writing projects under the guidance of professional, published writers. Editing, publishing, and performing are also integral parts of the program.\nThe Writing track is a unique set of courses that approaches writing as a process-based material practice. Courses are studio-based and emphasize the connection between other art, design, and media-based practices. You can move through these courses in multiple ways and with flexible timing.",
                    "url": "https://www.ecuad.ca/writing",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'N/A'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": [
                        "education",
                        "teachers"
                    ]
                },
                {
                    "courseName": "Photography",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "For those with a distinctive point of view.\nPhotography is an art practice rich in history and theory, with a range of processes and approaches. From digital to the darkroom, photography encompasses so much more than the camera—and sometimes, it doesn't even involve a camera at all.\nThe world of photography is rapidly evolving. In order to thrive, students need both practical and theoretical skills. This program is uniquely designed to equip students with just that, blending studio and classroom-based studies.\n\nWhat You Will Learn\nMultidisciplinary and innovative, the Photography major provides both knowledge and hands-on skills in a range of analogue and digital processes. Through art history, research, and critical courses, you'll study the work of historical and contemporary photographers and artists.\nIn both the classroom and your studio courses, you'll also have the opportunity to investigate how photography relates to other mediums, including installation, video, performance, printmaking, and directorial work.\nYou'll take a variety of approaches to the photograph as an object, and work in diverse environments, from studio shoots to street photography. You'll learn from renowned, professional photographers, hone your photography skills, and establish your own relationship to the art form.\nBoth your conceptual and hands-on learning will be strengthened through classes, seminars, self-directed projects, exhibitions, and professional development. Upon graduating, you'll have produced a substantial body of work and gained advanced knowledge of its place within contemporary photography practices.",
                    "url": "https://www.ecuad.ca/photography-program",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Industrial Design",
                    "faculty": "Design",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Experiment with new forms — and bring products, practices, and experiences to life.\nThe Industrial Design Major is an immersive and hands-on program that's all about understanding the complex world we live in, and responding to it in aesthetic, emotional, and material ways. Here, you'll create products, services and experiences that support relationships between individuals, communities, and the environment.\n\nWhat You Will Learn\nIf you're interested in prototyping products, designing services, crafting furniture, or examining material practices, the Industrial Design program was made for you.",
                    "url": "https://www.ecuad.ca/industrial-design",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Design'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Communication Design",
                    "faculty": "Design",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Craft compelling messages and unforgettable experiences.\nThe field of Communication Design is exciting and ever-changing. In our increasingly complex world, the thoughtful visual communication is in high demand. Here, you'll learn how to design strong visual narratives, messages, and experiences that respond to today's greatest communication challenges.\n\nWhat You Will Learn\nYour studies will combine theory and practice, exploring cultural, historical, technical, and ecological issues related to the field of visual design. This knowledge, combined with your hands-on studio courses, will equip you to develop an engaging communication design practice.\nIn the first years of your program, you'll take a required mix of core studio and critical studies courses. As you progress through your degree, you'll move toward more advanced and flexible electives that allow you to personalize your design education.\nThe communication design program encourages you to work collaboratively and engage with the ethical dimensions of design practice, in social, cultural, political and ecological contexts. You will develop an understanding of how your practice contributes to a culture of design in everyday life.\nYou'll delve into the areas of design that inspire you most — and define your own practice along the way. You’ll be able to explore typography, motion graphics, interactivity, wayfinding, information design, publication design, art direction, and other areas.\nYou’ll have the opportunity to enhance your studies by taking courses from complementary areas, including Interaction Design, 2D Animation, 3D Animation, Illustration, and Photography. Upon graduation, you’ll have a strong body of original work and the skills you need to launch your design career.",
                    "url": "https://www.ecuad.ca/communication-design",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Design'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": [
                        "arts",
                        "business",
                        "HR"
                    ]
                },
                {
                    "courseName": "2D + Experimental Animation",
                    "faculty": "Media Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Find your potential as an animation artist and filmmaker within the creative industries.\nThe field of animation is growing and filled with opportunities. Our 2D + Experimental Animation program equips you for a fulfilling career as an artist, animator, narrative storyteller, and filmmaker.\n\nWhat You Will Learn\nThrough traditional and digital drawing methods, students will learn everything they need to succeed as animation artists and filmmakers, with opportunities to experiment along the way. Our program prides itself on creative approaches to animation using a wide range of media, including the latest digital technologies, stop-motion, and motion graphics.\nThe program is designed to give you a thorough understanding of animation creativity and production.\nYou'll study all aspects of animation—from fundamental design principles and character development to storytelling, filmmaking, and advanced production techniques. You'll learn critical thinking skills, media theory and aesthetics, and the history of animation. You’ll also master the latest digital drawing techniques and animation software, and direct your own short films. Best of all, you'll be mentored by seasoned animation practitioners with contemporary skills and insights gained from the diverse cultural and entertainment sectors.\nOur program is unique in its balance of critical learning and hands-on creating, starting with animation principles, technical skills, and organizational abilities through smaller projects. Next, students focus on conceptual grounding in cinematic language, partnered with skill development and larger self-directed or collaborative projects. The program culminates with advanced courses and a capstone project in fourth year, through creative and conceptual development, production, and post-production methods, ending in a final public exhibition.\nWith these stand-alone experiences and projects under your belt upon graduation, you'll be prepared to jump straight into your career in the creative animation industries.",
                    "url": "https://www.ecuad.ca/2d-experimental-animation",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Media Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "medical"
                },
                {
                    "courseName": "3D + Computer Animation",
                    "faculty": "Media Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "For creative thinkers who want to bring their visions to life in 3D.\nEmily Carr is the only school in British Columbia to offer a bachelor’s degree in 3D and CG animation. Ranked one of the best animation programs in the world and the top program of its kind in Western Canada, our 3D Computer Animation program provides an unparalleled education in a fast and exciting industry.\n\nWhat You Will Learn\nOur 3D Computer Animation Major will give you all the skills you need to succeed in this competitive industry. You'll spend time in the classroom and the studio, covering everything from the history of design to the latest visual effects techniques.\nStudents master computer animation techniques, such as 3D modelling, texturing, grading, lighting and rendering. Character animation, filmmaking, storytelling, and production methodology. All of these skills will come together in the creation of your own graduation film.\nYou'll hone these creative skills while learning from the best animators in the industry. If you want a program built around new and innovative media—one that allows you to partner with international institutes and work across film production, video game development, research, and more—then this is the program for you.\nThis intensive program will prepare you to step into the industry as an animator, commercial artist, or independent filmmaker. Upon graduation, you’ll have created a short animated film that showcases your skills and celebrates your unique vision.",
                    "url": "https://www.ecuad.ca/3d-computer-animation",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Media Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": [
                        "engineering",
                        "computer"
                    ]
                },
                {
                    "courseName": "Drawing",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Through ink, pencil, or paint, make your mark on the world.\nDrawing is a way to engage with your surroundings and context, using a range of techniques and tools to translate, subvert, and communicate the world around you.\n\nWhat You Will Learn\nDrawing requires creativity and experimentation—it asks that you explore new modes of representation and use your unique perspective to reflect or reimagine an image. At the same time, it involves developing your technical skills so that you can bring your vision or concept to life.",
                    "url": "https://www.ecuad.ca/drawing",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                },
                {
                    "courseName": "Critical + Cultural Practices",
                    "faculty": "Fine Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Bridge critical theory and artistic practice.\nA degree designed to give you the best of both worlds, Critical + Cultural Practices provides a liberal arts education where your critical work is informed by your material practice— and vice versa. This rigorous academic program allows you to combine humanities courses with hands-on creativity.\n\nWhat You Will Learn\nIn this program, you will study art history, design history, English, humanities, media history, social sciences, and writing. While academic courses make up between 30 to 50 percent of other programs at ECU, they comprise a majority of credits for Critical + Cultural Practices.\nThese courses are designed with your practice in mind, in order to bring modern and contemporary approaches to your creative process. This interdisciplinary approach allows you to chart your own path while fostering connections between theory and practice. Throughout, you'll be taught by academics and artists who are leaders in their fields.\nYou will become part of a community of highly skilled practitioners, visionaries, and creative problem-solvers, with the knowledge to enter the visual arts and culture sector and to contribute from a variety of perspectives.",
                    "url": "https://www.ecuad.ca/academics/undergraduate-degrees/bachelor-of-fine-arts/critical-and-cultural-practice-major",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Fine Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    }
                },
                {
                    "courseName": "Film + Screen Arts",
                    "faculty": "Media Arts",
                    "programLength": "4 years",
                    "educationLevel": "Degree",
                    "studyType": "N/A",
                    "introduction": "Realize your potential as a visual storyteller.\nFor aspiring filmmakers and media artists alike, the Film + Screen Arts (FMSA) program is designed to provide you with the skills and frameworks you need to bring creative projects to life.\nLearn the fundamentals of film and media-making, from analogue and mechanical media to today's digital tools and techniques, including virtual and augmented reality. Whether you dream of becoming a cinematographer, director, set designer, sound designer, or editor, the FMSA program will prepare you for your future as a visual storyteller.\n\nWhat You Will Learn\nThe primary focus of Film + Screen Arts is practical, studio-based learning. You'll also take a robust and diverse selection of critical and cultural studies courses. Through both your hands-on and theoretical courses, you'll gain the skills and insights to produce film, video, media installation, sound, and other works at a professional level.\nAs you progress through your studies, you'll learn core technical and organizational competencies, and produce your own film and media projects both individually and collaboratively. In your third year of studies, you'll participate in intensive conceptual work, deepening your knowledge of film history and contexts. You'll also have the opportunity to take an internship course, either at ECU through positions with faculty, or with companies and organizations in Vancouver's thriving film industry.\nThe program culminates in your fourth year with a capstone project, where you'll produce a piece of work over a longer period of time, allowing for reflection and change throughout development, production, editing, and completion. You'll have opportunities to display and distribute this project by submitting to festivals, galleries, exhibitions, and web-oriented events. Most importantly, you'll graduate with an impressive body of work that will prepare you for further professional and artistic pursuits.\nAlong the way, you'll develop your unique creative voice and use film and screen arts to engage with social and political issues. Students benefit from a supportive peer network, extensive mentoring, and one-on-one support from our accomplished faculty of professional and award-winning filmmakers.",
                    "url": "https://www.ecuad.ca/fmsa",
                    "workExperience": "N/A",
                    "admissionInfo": {
                        "internationalHighSchool": {
                            "chineseHighSchool": {
                                "url": "https://d1bdilxpumkn65.cloudfront.net/assets/pdf-attachments/emily-carr-undergrad-admissions-guide-2021.pdf",
                                "cutOffMark": "N/A",
                                "tuition": "\"{'#text': '19,385.40', 'tuitionText': 'N/A', 'tuitionURL': 'https://www.ecuad.ca/about/administration/financial-services/tuition-fees/undergraduation-tuition-and-fees#2-0-2-2-2-0-2-3-domestic-tuition-+-fees'}\"",
                                "applicationDeadline": "\"{'deadline': 'N/A'}\"",
                                "requirements": "\"{'#text': 'Thinking of applying to Emily Carr University? All applicants must submit a portfolio online as part of the admission process.\\nStart working on your portfolio at least three to six months before the application deadline. Leave plenty of time for experimentation. For detailed portfolio requirements, visit ecuad.ca/portfolio.\\nThere are also academic requirements such as transcripts and English Language Proficiency tests that you will need to send during the application period.\\nApplications open September 15. See our website for application deadlines.', 'h4': 'Media Arts'}\"",
                                "additonalRequirements": "\"N/A\""
                            }
                        }
                    },
                    "importantTag": "arts"
                }
            ]
        }
    }
}